БПКР/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВидыНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНачислений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазовоеНачисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВидыНачислений</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтражения</name>
      <type>
        <types>CatalogRef.СпособыОтраженияЗаработнойПлаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнаяКорректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/Enums/СпособыРасчетаНачислений/СпособыРасчетаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаНачислений</name>
  <enumValues>
    <name>ПоМесячнойСтавкеПоДням</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоДневнойСтавке</name>
  </enumValues>
  <enumValues>
    <name>Процентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ФиксированнойСуммой</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойСтавкеПоЧасам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоЧасовойСтавке</name>
  </enumValues>
  <enumValues>
    <name>РаботаСверхурочно</name>
  </enumValues>
  <enumValues>
    <name>ВыходныеИПраздничные</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничного</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>Неявка</name>
  </enumValues>
  <enumValues>
    <name>ГодоваяПремия</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяФормула</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Documents/НачислениеЗарплаты/Forms/ФормаВыбораВидаНачислений/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	Валюта = ВалютаРегламентированногоУчета;
		
	// РаботаСФормами
	РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец РаботаСФормами	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)

	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ВидРасчета", ВидРасчета);
	СтруктураДанные.Вставить("Валюта", Валюта);
	СтруктураДанные.Вставить("Размер", Размер);

	Оповестить("ВыборНачисления", СтруктураДанные, ВладелецФормы);
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Если ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаНачислений.Процентом Тогда 
		Валюта = ВалютаРегламентированногоУчета;
		Элементы.Валюта.ТолькоПросмотр = Истина;
	Иначе 
		Элементы.Валюта.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
КонецПроцедуры // УстановитьВидимостьДоступностьЭлементов()

#КонецОбласти
